[
    {
        "recipe_name": "Spaghetti Carbonara",
        "description": "Classic Italian pasta dish made with eggs, cheese, pancetta, and black pepper.", 
        "filename": "/public/img/spahetti-carbonara.jpg",
        "ingredients": "12 ounces (340g) spaghetti pasta. 4 ounces (115g) pancetta or guanciale, diced. 3 large eggs. 1 cup (about 100g) grated Pecorino Romano cheese. 1/2 cup (about 50g) grated Parmesan cheese. Freshly ground black pepper. Salt (for pasta water).",
        "instructions": "Bring a large pot of salted water to a boil. Cook the spaghetti according to the package instructions until al dente. Reserve about 1 cup of pasta cooking water, then drain the spaghetti and set aside. While the pasta is cooking, heat a large skillet over medium heat. Add the diced pancetta or guanciale and cook until golden and crisp, about 5-7 minutes. Remove from the heat and set aside. In a mixing bowl, whisk together the eggs, grated Pecorino Romano cheese, and grated Parmesan cheese until well combined. Once the spaghetti is cooked and drained, immediately transfer it to the skillet with the cooked pancetta or guanciale. Toss the spaghetti with the pancetta/guanciale and its rendered fat over low heat for about 1 minute, allowing the pasta to absorb some of the flavor. Remove the skillet from the heat. Quickly pour the egg and cheese mixture over the hot spaghetti while continuously tossing or stirring the pasta to evenly coat it with the sauce. The residual heat from the pasta will cook the eggs and create a creamy sauce. If the sauce seems too thick, gradually add some of the reserved pasta cooking water, a little at a time, until the desired consistency is reached. Season the spaghetti carbonara generously with freshly ground black pepper. Taste and adjust seasoning if necessary, keeping in mind that the pancetta or guanciale and cheeses are already salty. Serve the spaghetti carbonara immediately, garnished with additional grated cheese and black pepper if desired. Enjoy your delicious traditional Italian dish!", 
        "has_meat": "true", 
        "user_id": 1
    },
    {
        "recipe_name": "Caprese Salad",
        "description": "Refreshing salad made with ripe tomatoes, fresh mozzarella cheese, basil leaves, olive oil, and balsamic glaze.",
        "filename": "/public/img/caprese-salad.jpg",
        "ingredients": "3 large ripe tomatoes, sliced. 8 ounces (225g) fresh mozzarella cheese, sliced. Fresh basil leaves. Extra virgin olive oil. Balsamic glaze (optional). Salt and freshly ground black pepper, to taste.",
        "instructions": "Arrange alternating slices of tomatoes and mozzarella cheese on a serving platter. Tuck fresh basil leaves between the tomato and cheese slices. Drizzle extra virgin olive oil over the salad. Drizzle balsamic glaze over the top. Season with salt and black pepper to taste. Serve immediately as a refreshing appetizer or side dish.",
        "has_meat": "false",
        "user_id": 2
    },
    {
        "recipe_name": "Pakistani Biryani",
        "description": "Fragrant and flavorful rice dish cooked with aromatic spices, meat, and saffron, a popular dish in Pakistani cuisine.",
        "filename": "/public/img/pakistani-biryani.jpg",
        "ingredients": "2 cups basmati rice, soaked for 30 minutes. 1 lb chicken, cut into pieces. 1 large onion, thinly sliced. 1 cup plain yogurt. 2 tomatoes, chopped. 2 potatoes, peeled and quartered. 4 green chilies, slit. 1/4 cup chopped fresh coriander leaves. 1/4 cup chopped fresh mint leaves. 1 tablespoon ginger-garlic paste. Whole spices (cinnamon, cardamom, cloves, bay leaves). Saffron strands soaked in warm milk. Ghee or cooking oil. Salt to taste.",
        "instructions": "Heat ghee or oil in a large pot. Add sliced onions and cook until golden brown. Remove half and set aside. Add whole spices and ginger-garlic paste to the pot. Cook until fragrant. Add chicken pieces, yogurt, chopped tomatoes, potatoes, green chilies, and half of the chopped coriander and mint leaves. Cook until chicken is partially cooked. In a separate pot, boil water and cook soaked rice until partially done. Drain and set aside. Layer the partially cooked rice over the chicken mixture. Sprinkle with remaining coriander and mint leaves, fried onions, and saffron-infused milk. Cover and cook on low heat until the rice is fully cooked and the flavors are melded together. Serve hot with raita.",
        "has_meat": "true",
        "user_id": 3
    },
    {
        "recipe_name": "Russian Beef Stroganoff",
        "description": "A creamy and savory beef dish served with noodles or rice, a classic in Russian cuisine.",
        "filename": "/public/img/russian-beef-stroganoff.jpg",
        "ingredients": "1 lb beef sirloin, thinly sliced. 1 onion, thinly sliced. 2 cloves garlic, minced. 1 cup mushrooms, sliced. 2 tablespoons butter. 2 tablespoons all-purpose flour. 1 cup beef broth. 1/2 cup sour cream. 1 tablespoon Dijon mustard. 1 tablespoon Worcestershire sauce. Salt and pepper to taste. Chopped fresh parsley, for garnish. Cooked egg noodles or rice, for serving.",
        "instructions": "In a skillet, melt butter over medium heat. Add sliced beef and cook until browned. Remove beef from skillet and set aside. In the same skillet, add sliced onions and cook until translucent. Add minced garlic and sliced mushrooms. Cook until mushrooms are tender. Sprinkle flour over the mushroom mixture and cook for 1-2 minutes. Gradually pour in beef broth, stirring constantly to avoid lumps. Bring to a simmer. Return cooked beef to the skillet. Stir in sour cream, Dijon mustard, and Worcestershire sauce. Season with salt and pepper to taste. Simmer gently for a few minutes until the sauce thickens and the beef is heated through. Serve hot over cooked egg noodles or rice. Garnish with chopped parsley.",
        "has_meat": "true",
        "user_id": 4
    },
    {
        "recipe_name": "Thai Green Curry",
        "description": "A fragrant and spicy curry made with green curry paste, coconut milk, vegetables, and chicken, a staple in Thai cuisine.",
        "filename": "/public/img/thai-green-curry.jpg",
        "ingredients": "1 lb boneless, skinless chicken breasts, sliced. 2 tablespoons green curry paste. 1 can (13.5 oz) coconut milk. 1 cup chicken broth. 1 tablespoon fish sauce. 1 tablespoon brown sugar. 1 bell pepper, sliced. 1 eggplant, diced. 1 cup green beans, trimmed. 1 cup sliced mushrooms. Fresh basil leaves, for garnish. Cooked jasmine rice, for serving.",
        "instructions": "In a large skillet or wok, heat some oil over medium heat. Add green curry paste and cook for 1-2 minutes until fragrant. Add sliced chicken breasts to the skillet and cook until browned. Stir in coconut milk, chicken broth, fish sauce, and brown sugar. Bring to a simmer. Add sliced bell pepper, diced eggplant, green beans, and sliced mushrooms to the skillet. Simmer for 10-15 minutes or until vegetables are tender and chicken is cooked through. Taste and adjust seasoning if necessary.Serve hot over cooked jasmine rice. Garnish with fresh basil leaves.",
        "has_meat": "true",
        "user_id": 5
    },
    {
        "recipe_name": "French Coq au Vin",
        "description": "A classic French dish of chicken braised in red wine with mushrooms, onions, and bacon, full of rich and deep flavors.",
        "filename": "/public/img/coq-au-vin.jpg",
        "ingredients": "4 slices bacon, chopped. 4 chicken thighs. Salt and pepper to taste. 1 onion, chopped. 2 cloves garlic, minced. 1 cup red wine (such as Burgundy). 1 cup chicken broth. 1 tablespoon tomato paste. 1 teaspoon dried thyme. 8 ounces mushrooms, sliced. Fresh parsley, for garnish.",
        "instructions": "In a large skillet or Dutch oven, cook chopped bacon until crisp. Remove bacon from skillet and set aside. Season chicken thighs with salt and pepper. Brown chicken thighs in the bacon fat until golden on both sides. Remove chicken from skillet and set aside. In the same skillet, add chopped onion and minced garlic. Cook until softened. Pour in red wine and chicken broth. Stir in tomato paste and dried thyme. Bring to a simmer. Return chicken thighs and cooked bacon to the skillet. Add sliced mushrooms. Cover and simmer gently for 30-40 minutes or until chicken is cooked through and tender. Taste and adjust seasoning if necessary. Serve hot, garnished with fresh parsley.",
        "has_meat": "true",
        "user_id": 6
    },
    {
        "recipe_name": "Indian Palak Paneer",
        "description": "A classic North Indian dish made with spinach (palak) and paneer (Indian cottage cheese), simmered in a creamy and flavorful tomato-based sauce.",
        "filename": "/public/img/palak-paneer.jpg",
        "ingredients": "1 lb fresh spinach leaves, washed and chopped. 8 oz paneer, cubed. 1 onion, finely chopped. 2 tomatoes, pureed. 2 cloves garlic, minced. 1-inch piece of ginger, grated. 1 green chili, chopped (optional). 1 teaspoon cumin seeds. 1 teaspoon garam masala. 1/2 teaspoon turmeric powder. 1/2 teaspoon ground coriander. 1/4 teaspoon red chili powder. 1/4 cup heavy cream. Salt to taste. Ghee or cooking oil.",
        "instructions": "Heat ghee or oil in a large skillet over medium heat. Add cumin seeds and let them splutter. Add chopped onions and sauté until golden brown. Add minced garlic, grated ginger, and chopped green chili (if using). Cook for another minute. Stir in pureed tomatoes and cook until the mixture thickens. Add turmeric powder, ground coriander, red chili powder, and salt. Mix well. Add chopped spinach leaves to the skillet and cook until wilted. Using an immersion blender or food processor, blend the spinach mixture until smooth. Return the blended mixture to the skillet. Add cubed paneer and garam masala. Simmer for a few minutes. Stir in heavy cream and cook for another 2-3 minutes. Adjust seasoning if needed. Serve hot with steamed rice or naan bread.",
        "has_meat": "false",
        "user_id": 7
    },
    {
        "recipe_name": "Greek Spanakopita",
        "description": "A savory Greek pastry filled with spinach, feta cheese, onions, and herbs, layered between flaky phyllo dough sheets.",
        "filename": "/public/img/greek-spanakopita.jpg",
        "ingredients": "1 lb fresh spinach leaves, washed and chopped. 1 onion, finely chopped. 2 cloves garlic, minced. 1 cup crumbled feta cheese. 1/4 cup chopped fresh dill. 1/4 cup chopped fresh parsley. 1/4 cup olive oil. Salt and pepper to taste. 1/2 lb phyllo dough, thawed if frozen. Butter or olive oil for brushing.",
        "instructions": "Preheat your oven to 350°F (175°C). Grease a baking dish with butter or olive oil. Heat olive oil in a large skillet over medium heat. Add chopped onions and minced garlic. Cook until softened. Add chopped spinach leaves to the skillet. Cook until wilted. Remove the skillet from heat and stir in crumbled feta cheese, chopped fresh dill, chopped fresh parsley, salt, and pepper. Unroll the phyllo dough sheets and cover them with a damp kitchen towel to prevent drying out. Place one sheet of phyllo dough in the greased baking dish. Brush with melted butter or olive oil. Repeat layering with several more sheets of phyllo dough, brushing each layer with butter or olive oil. Spread the spinach and feta mixture evenly over the layered phyllo dough. Continue layering the remaining phyllo dough sheets on top of the spinach mixture, brushing each layer with butter or olive oil. Once all the phyllo dough sheets are used, brush the top layer with butter or olive oil. Using a sharp knife, score the top layer of the spanakopita into squares or triangles. Bake in the preheated oven for 45-50 minutes or until golden brown and crispy. Allow the spanakopita to cool slightly before slicing and serving.",
        "has_meat": "false",
        "user_id": 8
    }
]